#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_bot.azuread_application.application will be created
  + resource "azuread_application" "application" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "koichi-furukawa-example-1-dev"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # module.azure_bot.azurerm_bot_service_azure_bot.azure_bot will be created
  + resource "azurerm_bot_service_azure_bot" "azure_bot" {
      + display_name                 = (known after apply)
      + icon_url                     = "https://docs.botframework.com/static/devportal/client/images/bot-framework-default.png"
      + id                           = (known after apply)
      + local_authentication_enabled = true
      + location                     = "global"
      + microsoft_app_id             = (known after apply)
      + microsoft_app_type           = "MultiTenant"
      + name                         = "koichi-furukawa-example-1-bot-dev"
      + resource_group_name          = "koichi-furukawa-example-1-rg-dev"
      + sku                          = "F0"
      + streaming_endpoint_enabled   = false
    }

  # module.azure_bot.azurerm_resource_group.azure_bot_rg will be created
  + resource "azurerm_resource_group" "azure_bot_rg" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "koichi-furukawa-example-1-rg-dev"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kooooichi24, Action: `pull_request`, Working Directory: `./dev`, Workflow: `Terraform Plan`*